In [11]:
import pandas as pd
import numpy as np

Task1

In [14]:
authors_df = pd.DataFrame({'authors_id':[1, 2, 3],
                           'authors_name':['Turgenev', 'Chekhov', 'Astrovsky']})
authors_df

   authors_id authors_name
0           1     Turgenev
1           2      Chekhov
2           3    Astrovsky

In [15]:
books_df = pd.DataFrame({'authors_id':[1, 1, 1, 2, 2, 3, 3],
                         'books_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                         'price':[450, 300, 350, 500, 450, 370, 290]   })
books_df

   authors_id           books_title  price
0           1           Отцы и дети    450
1           1                 Рудин    300
2           1     Дворянское гнездо    350
3           2      Толстый и тонкий    500
4           2       Дама с собачкой    450
5           3                 Гроза    370
6           3  Таланты и поклонники    290

Task2

In [36]:
authors_price = pd.merge(authors_df, books_df, on = 'authors_id', how = 'inner')
authors_price.set_index('authors_id', inplace = True)
authors_price

           authors_name           books_title  price
authors_id
1              Turgenev           Отцы и дети    450
1              Turgenev                 Рудин    300
1              Turgenev     Дворянское гнездо    350
2               Chekhov      Толстый и тонкий    500
2               Chekhov       Дама с собачкой    450
3             Astrovsky                 Гроза    370
3             Astrovsky  Таланты и поклонники    290

In [18]:
top_5 = authors_price.nlargest(5, 'price')
top_5

   authors_id authors_name        books_title  price
3           2      Chekhov   Толстый и тонкий    500
0           1     Turgenev        Отцы и дети    450
4           2      Chekhov    Дама с собачкой    450
5           3    Astrovsky              Гроза    370
2           1     Turgenev  Дворянское гнездо    350

Task4

In [80]:
### Наверно есть более прстое решение через срезы, но чет я не смог
authors_stat = pd.DataFrame(index = [1,2,3])
authors_stat['authors_name'] = authors_price.authors_name.unique()
authors_stat['min_prace'] = authors_price.groupby('authors_id').agg({'price':'min'}) 
authors_stat['mean_prace'] = authors_price.groupby('authors_id').agg({'price':'mean'})
authors_stat['max_prace'] = authors_price.groupby('authors_id').agg({'price':'max'})
authors_stat

  authors_name  min_prace  mean_prace  max_prace
1     Turgenev        300  366.666667        450
2      Chekhov        450  475.000000        500
3    Astrovsky        290  330.000000        370

Task5

In [39]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

           authors_name           books_title  price    cover
authors_id
1              Turgenev           Отцы и дети    450  твердая
1              Turgenev                 Рудин    300   мягкая
1              Turgenev     Дворянское гнездо    350   мягкая
2               Chekhov      Толстый и тонкий    500  твердая
2               Chekhov       Дама с собачкой    450  твердая
3             Astrovsky                 Гроза    370   мягкая
3             Astrovsky  Таланты и поклонники    290   мягкая

In [62]:
book_info = pd.pivot_table(authors_price, values = 'price', index = ['authors_name'], 
                           columns = ['cover'], aggfunc = np.sum)
book_info['мягкая'].fillna('0', inplace = True)
book_info['твердая'].fillna('0', inplace = True)
book_info

cover        мягкая твердая
authors_name
Astrovsky       660       0
Chekhov           0     950
Turgenev        650     450

In [67]:
book_info.to_pickle('book_info.pkl')

In [69]:
book_info2 = pd.read_pickle('book_info.pkl')

In [70]:
book_info == book_info2

cover         мягкая  твердая
authors_name
Astrovsky       True     True
Chekhov         True     True
Turgenev        True     True